
&Вместо("КонтрольОстатков")
Функция ЮТКонтрольОстатков()
	ПараметрыМетода = Новый Массив();
	
	ПрерватьВыполнение = Ложь;
	Результат = Мокито.АнализВызова(ЭтотОбъект, "ОбработкаПроведения", ПараметрыМетода, ПрерватьВыполнение);
	
	Если НЕ ПрерватьВыполнение Тогда
		Возврат ПродолжитьВызов();
	Иначе
		Возврат Результат;
	КонецЕсли;
КонецФункции

&Вместо("ОбработкаПроведения")
Процедура ЮТОбработкаПроведения(Отказ, Режим)
	ПараметрыМетода = Мокито.МассивПараметров(Отказ, Режим);
	
	ПрерватьВыполнение = Ложь;
	Мокито.АнализВызова(ЭтотОбъект, "ОбработкаПроведения", ПараметрыМетода, ПрерватьВыполнение);
	
	Если НЕ ПрерватьВыполнение Тогда
		ПродолжитьВызов(Отказ, Режим);
	КонецЕсли;
КонецПроцедуры
