
&Вместо("АктивныеНастройкиОбмена")
Функция ЮТАктивныеНастройкиОбмена() Экспорт
	ПараметрыМетода = Новый Массив();
	
	ПрерватьВыполнение = Ложь;
	Результат = Мокито.АнализВызова(ИнтеграцияМагазин, "АктивныеНастройкиОбмена", ПараметрыМетода, ПрерватьВыполнение);
	
	Если НЕ ПрерватьВыполнение Тогда
		Возврат ПродолжитьВызов();
	Иначе
		Возврат Результат;
	КонецЕсли;
КонецФункции

&Вместо("ЗафиксироватьОшибкуЗапроса")
Процедура ЮТЗафиксироватьОшибкуЗапроса(Настройка, Результат)
	ПараметрыМетода = Мокито.МассивПараметров(Настройка, Результат);
	
	ПрерватьВыполнение = Ложь;
	Мокито.АнализВызова(ИнтеграцияМагазин, "ЗафиксироватьОшибкуЗапроса", ПараметрыМетода, ПрерватьВыполнение);
	
	Если НЕ ПрерватьВыполнение Тогда
		ПродолжитьВызов(Настройка, Результат);
	КонецЕсли;
КонецПроцедуры

&Вместо("ВыполнитьОбмен")
Процедура ЮТВыполнитьОбмен(Настройка) Экспорт
	ПараметрыМетода = Мокито.МассивПараметров(Настройка);
	
	ПрерватьВыполнение = Ложь;
	Мокито.АнализВызова(ИнтеграцияМагазин, "ВыполнитьОбмен", ПараметрыМетода, ПрерватьВыполнение);
	
	Если НЕ ПрерватьВыполнение Тогда
		ПродолжитьВызов(Настройка);
	КонецЕсли;
КонецПроцедуры
